       05  INDEP.
           10 INDEP-DEPTNO                 PIC X(03).
           10 INDEP-DEPTNAME               PIC X(36).
           10 INDEP-MGRNO                  PIC X(06).
           10 INDEP-ADMRDEPT               PIC X(03).
           10 INDEP-LOCATION               PIC X(16).